# Pandas - Dataframes

In [127]:
import pandas as pd
import numpy as np

Setando padrão para os números aleatórios:

In [128]:
np.random.seed(101)

In [129]:
ind = 'A B C D E'
col = 'X Y W Z'

Criando DataFrame(Arquivo, indice, colunas):

In [130]:
df = pd.DataFrame(np.random.randn(5,4), index.split(), columns.split())

In [131]:
df

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Fatiamento do dataframe:

In [132]:
df['W']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: W, dtype: float64

In [133]:
type(df['W']) # A fatia de um dataframe é uma series

pandas.core.series.Series

In [134]:
df[['W','Z']]

          W         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [135]:
df.W

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: W, dtype: float64

Adicionando coluna 'new', que soma as colunas 'W' e 'X':

In [136]:
df['new'] = df['W'] + df['X']

In [137]:
df

          X         Y         W         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

### Deletando colunas/linhas:

drop() possui o paramêtro axis, que quando = 0 exclui linhas e quando = 1 exclui colunas

In [138]:
df.drop('A')

          X         Y         W         Z       new
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [139]:
df.drop('new', axis=1)

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [140]:
df # permanece inalterado pois inplace = False

          X         Y         W         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [141]:
df['new'] = df['W'] + df['X']

In [142]:
df

          X         Y         W         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

Para se alterar o dataframe, o parâmetro inplace deve ser True

In [143]:
df.drop('new',axis=1, inplace=True)

In [144]:
df # dataframe alterado

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Selecionando Fatias do Dataframe

In [145]:
df.loc['A', 'W']

0.9079694464765431

In [146]:
df.loc['A']

X    2.706850
Y    0.628133
W    0.907969
Z    0.503826
Name: A, dtype: float64

In [147]:
df.loc[['A','B'], ['X', 'Y', 'Z']]

          X         Y         Z
A  2.706850  0.628133  0.503826
B  0.651118 -0.319318  0.605965

In [148]:
df.iloc[1:4,2:] # iloc utiliza notação numpy :indices

          W         Z
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057

Quais os elementos do dataframe que são >0

In [149]:
df > 0

       X      Y      W      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

Para que os valores maiores que 0 sejam mostrados na tabela:

In [150]:
bol = df>0

In [151]:
df[bol]

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

Mostrando somente colunas e linhas com os elementos da coluna W sendo >0

In [152]:
df[df['W']>0]

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

Mostrando elementos da coluna 'Y' com linhas que também possuem o valor de 'W' maior que 0

In [153]:
df[df['W']>0]['Y']

A    0.628133
C    0.740122
E    1.978757
Name: Y, dtype: float64

Ou

In [154]:
bol = df['W']>0
df2 = df[bol]
df2['Y']

A    0.628133
C    0.740122
E    1.978757
Name: Y, dtype: float64

Mostrando linhas que possuem 'W'>0 e 'Y'>1

In [155]:
df[(df['W']>0) & (df['Y']>1)]

          X         Y         W         Z
E  0.190794  1.978757  2.605967  0.683509

Mostrando linhas que possuem 'W'>0 ou 'Y'>1

In [156]:
df[(df['W']>0) | (df['Y']>1)]

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

Mudando indice para números:

In [157]:
df.reset_index(inplace=True)

In [158]:
df

  index         X         Y         W         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

Adicionando coluna 'states'

In [159]:
states = 'RN SP SC RS PR'.split()

In [160]:
states

['RN', 'SP', 'SC', 'RS', 'PR']

In [161]:
df['State'] = states

In [162]:
df

  index         X         Y         W         Z State
0     A  2.706850  0.628133  0.907969  0.503826    RN
1     B  0.651118 -0.319318 -0.848077  0.605965    SP
2     C -2.018168  0.740122  0.528813 -0.589001    SC
3     D  0.188695 -0.758872 -0.933237  0.955057    RS
4     E  0.190794  1.978757  2.605967  0.683509    PR

Colocando estado como indice:

In [163]:
df.set_index('State', inplace=True)

In [164]:
df

      index         X         Y         W         Z
State
RN        A  2.706850  0.628133  0.907969  0.503826
SP        B  0.651118 -0.319318 -0.848077  0.605965
SC        C -2.018168  0.740122  0.528813 -0.589001
RS        D  0.188695 -0.758872 -0.933237  0.955057
PR        E  0.190794  1.978757  2.605967  0.683509

Excluindo a coluna 'index'

In [165]:
df.drop('index', axis=1)

              X         Y         W         Z
State
RN     2.706850  0.628133  0.907969  0.503826
SP     0.651118 -0.319318 -0.848077  0.605965
SC    -2.018168  0.740122  0.528813 -0.589001
RS     0.188695 -0.758872 -0.933237  0.955057
PR     0.190794  1.978757  2.605967  0.683509